flix/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"  WHERE (released_on <= '2016-02-23 20:14:24.347134')  ORDER BY released_on desc
---
  def index
      @movies = Movie.all