app/controllers/reviews_controller.rb

  def create

    @review = @movie.reviews.new(review_params)
    @review.user = current_user
    if @review.save
---
INSERT INTO "reviews" ("comment", "created_at", "movie_id", "name", "stars", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "test"], ["created_at", "2016-02-23 20:16:28.908766"], ["movie_id", 7], ["name", "Test"], ["stars", 4], ["updated_at", "2016-02-23 20:16:28.908766"]]