flix/app/views/movies/index.html.erb

<h1><%= pluralize(@movies.size, 'Movie') %></h1>
---
SELECT "movies".* FROM "movies"  WHERE (released_on <= '2016-02-23 20:14:24.347134')  ORDER BY released_on desc